# Это чистая основа для контейнера, slim-облегченная версия для моих зависимостей.
FROM python:3.11-slim

# рабочая папка внутри контейнера, все копирование и запуски будут происходить в ней.
WORKDIR /app

# Копируем файл зависимостей сначала, чтобы кэшировать слои и не качать всё заново при каждом изменении кода.
COPY requirements.txt . 

# Устанавливаем список пакетов из файла txt, no cache dir не сохраняет кэш загруженных файлов внутри образа.
RUN pip install --upgrade pip
RUN pip install --no-cache-dir -r requirements.txt

# Первая точка, копируем всё из текущей папки компьютера. Вторая точка, копируеться в текущую папку внутри контейнера что есть в проекте в папку app.
COPY . .

# Команда для запуска собранного контейнера. Сервер берет путь к моему приложению app, слушает все сетевые интерфейсы внутри контейнера, ождиание порта, и делает перзагрузку при изменении кода.
CMD ["uvicorn", "app.main:app", "--host", "0.0.0.0.", "--port", "8000", "--reload"]